0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }
    lowerInlet
    {
        type            fixedValue;
        value           uniform (18.7939 6.8404 0);
    }
    upperInlet
    {
        type            fixedValue;
        value           uniform (18.7939 -6.8404 0);
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
